import 'package:flutter/material.dart';
class S1 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
      child: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('assets/image/كيكة.jpg'),
            Text('الخطوة الأولى في الخلاط الكهربائي، يخلط الحليب، الزيت، السكر والكاكاو ثم يؤخذ منه كوب ويوضع في الثلاجة.الخطوة الثانيهيوضع البيض، الدقيق، البيكنج بودر والفانيليا على باقي الخليط ثم يخفق جيداً.الخطوة الثالثهيوضع الخليط في قالب أو صينية مدهونة بالزيت أو الزبدة.الخطوة الرابعهيوضع القالب في فرن محمى مسبقاً على 150 درجة.الخطوة الاخيرهيخرج من الفرن بعد إستوائه ويرضع كوب الخليط الذي رفع جانباً على الوجه و يمكن التزين حسب الذوق',
              style: TextStyle(
                fontSize: 20,
              ),
              textDirection:TextDirection.rtl,
            )
          ],
        ),
      ),
    );
  }
}

class S2 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(

      child: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('assets/image/بسبوسة.jpg'),
            Text('نضع السميد في بولة وننزل عليه بالسكر وجوز الهند والبيكنج بودر ونقلب حتي تتجانس المقادير.نحمي الفرن علي درجة حرارة 200 درجة مئوية.نضع السمنة في بولة أخري وننزل عليها بملعقة العسل ثم نقلب وإذا لم يتجانس العسل مع السمنة يمكننا رفعها علي النار حتي تمتزج المقادير.نضع خليط السمنة والعسل علي خليط السميد السابق ونقلب حتي تتجانس المقادير.نضع الزبادي علي خليط السميد ونخلط بحيث تتجانس جميع المكونات ولكن لا نكثر من الخلط حتي لا تصبح البسبوسة جافة معناندهن صينية بالطحينة وملعقة السمنة ثم نضع عجينة السميد بها ونوزعها علي الصينية بالتساوي ونساوي الوجه ، ويمكننا تزيينها بالمكسرات حسب الرغبة ثم وندخلها الفرن لمدة نصف ساعة حتي تأخذ اللون الذهبي.خلال وضع البسبوسة في الفرن يجب علينا تحضير السيرب فنقوم بوضع السكر والماء في إناء ونقلب ثم نرفعه علي النار وعندما يبدأ في الغليان نقوم بإضافة عصير الليمون والفانيليا وملعقتين العسل الأبيض ثم نهدئ النار ونترك السيرب يغلي لمدة 5 دقائق ثم نطفئ النار.عندما يتم نضج البسبوسة نخرجها من الفرن ونسقيها بالشربات ونغطيها حتي تهدأ من الحرارة ثم نقوم بتقطيعها وتقديمها وبالهنا والعافية.'
              ,
              style: TextStyle(
                fontSize: 20,
              ),
              textDirection:TextDirection.rtl,
            )
          ],
        ),
      ),
    );
  }
}
class S3 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
      child: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('assets/image/سويسرول.jpg'),
            Text('اضربى البيض مضافًا إليه الفانيليا حتى يتضاعف حجمه ثم اضيفى إليه السكر واستمرى بالضرب إلى أن يصبح الخليط سميكًا، ضيفى الدقيق بالبيكنج بودر إلى الخليط السابق بخفة واستمرى بالضرب إلى أن يمتزج تمامًا ثم صبى الخليط فى القالب وأدخليه الفرن لمدة 10 دقائق.،اقلبى قالب السويسرول بعد أن ينضج على ورق زبدة مرشوش عليه سكر بودرة واتركيه إلى أن يبرد',
              style: TextStyle(
                fontSize: 20,
              ),
              textDirection:TextDirection.rtl,
            )
          ],
        ),
      ),
    );
  }
}
