import 'package:flutter/material.dart';
class B1 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
      child: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('assets/image/بيتزا.jpg'),
            Text('وضع كلٍ من السكر، والملح، وأربعة أكواب من الدقيق، والخميرة في وعاء الخلاط، وتثبيت مضرب العجين، ومن ثم تشغيل الخلاط على سرعة بطيئة لعدة ثواني إلى أن يتم خلط المواد.إضافة كلٍ من الزعتر، والزيت، والزبادي، ومن ثم عجن المكوّنات على سرعة متوسطة لمدة دقيقتين، ثم إضافة الماء وعجنه إلى أن تتكون عجينة ناعمة وملساء، وإضافة الكمية المتبقية من الطحين إذا كانت العجينة لينة.وضع العجينة في طبق مدهون بالزيت، وتغطية العجينة بقطعة من النايلون ووضعها في مكان دافئ إلى أن يتضاعف حجمها.إحضار صينية قصيرة الحافة ودهنها بكمية وفيرة من الزيت، ومن ثم وضع العجينة في الصينية وفردها بأطراف أصابع اليد بحيث يتم تغطية قاع الصينية. تغطية البيتزا بقطعة من النايلون، وتركها في مكان دافئ حتى يتضاعف حجمها، ثم الضغط عليها بأطراف أصابع اليد، ومن ثم توزيع كلٍ من السماق، والزيت، والزعتر. تثبيت الرف الشبكي في وسط الفرن، وتسخين الفرن إلى درجة حرارة مئة وثمانين درجة مئوية.خبز البيتزا لمدة عشرين دقيقة في الفرن، ومن ثم تقديمها. بيتزا بصلصة الباربكيو المكوّنات كوب من الجبنة المبشورة',
              style: TextStyle(
                fontSize: 20,
              ),
              textDirection:TextDirection.rtl,
            )
          ],
        ),
      ),
    );
  }
}

class B2 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
      child: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('assets/image/سينابون.jpg'),
            Text('سخن الحليب في الميكرويف مدّة ٤٥ إلى ٦٠ ثانية، وضعه في الخلاط الكهربائي.أضف ملعقة صغيرة من السكر والخميرة إلى الحليب، وامزجهم قليلًا، ثم اتركه مدّة ٥ دقائق أضف الزبدة والفانيليا ونصف كوب سكر والبيض للخلاط، وقلبهم قليلًاأضف الدقيق والملح والقرفة، وقلبهم معًا ليتجانس العجين ويمتزج جيدًااعجن العجين ليتشكّل لديك عجينة كبيرة متماسكة وناعمةانقل العجين إلى سطح مستوٍ ومرشوش بالدقيق، واعجنها بيديك جيدًا حوالي ٥ دقائق.أحضر وعاء كبير، وادهنه بالقليل من الزيت، وضع العجين داخله، وغطِّ الوعاء بمنشفة دافئة قليلًااترك العجين جانبًا حتى ترتفع ويزداد حجمها في مكان دافئ مدّة ساعة قطع العجين بعد ذلك إلى ١٢ قطعة متساوية، وافردها على سطح مستوى احشو العجينة حسب الرغبة، ولفها، واخبزها في الفرن حتى تنضج',
              style: TextStyle(
                fontSize: 20,
              ),
              textDirection:TextDirection.rtl,
            )
          ],
        ),
      ),
    );
  }
}
class B3 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
      child: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset('assets/image/كرواسون.jpg'),
            Text('خطوات التحضير :في بولة عميقة نضع ٢ كوب كبير من الدقيقو يضاف إليه الخميرة و السكر و الملح و اللبن البودرة و يخلط المزيج جيداً.يضاف الماء الى مزيج الدقيق تدريجيا و يخلط المزيج مرة أخرى حتى تتجانس المكونات.تغطى العجينة و تترك لمدة ١٠ دقائق حتى تخمر.بعد ال ١٠ دقائق و بعد ان تخمر العجين نضع الزيت و باقي كمية الدقيق و تعجن العجينة مرة أخرى، حتى نحصل على عجينة طرية و متماسكة.تقسم عجينة ال ١٠ دقائق إلى كرات متوسطة الحجم و تترك لمدة ٥ لترتاح قليلاً.على سطح مرشوش عليه القليل من الدقيق تفرد كل كرة من العجينة بالنشابة حتى تصبح رقيقة و تدهن بالزبدة.توضع كرات العجين فوق بعضها البعض، مع ضرورة دهن زبدة بين كل طبقة والأخرى.تفرد كل الطبقات مرة أخرى بالنشابة حتى تصبح رقيقة ثم تقطع إلى مثلثات متساوية الحجم.يوضع الحشو المفضل للكرواسون ثم تلف ابتداءا من رأس مثلث العجينة الى القاعدة.تدهن صينية فرن بالزبدة ثم توضع قطع الكرواسون في الصينية.تخفق البيضة جيدا مع الفانيليا ثم نقوم بدهن الكرواسون بها ثم نتركة لمدة ٣٠دقيقة أخرى حتى يتخمر.يسخن الفرن على درجة حرارة ١٨٠ درجة مئوية.توضع الصينية في الفرن بعد تسخين الفرن ب ١٠دقائق لمدة من ٢٠ إلى ٢٥دقيقة، و حتى ينضج الكرواسون و يحمر.و يقدم مع المربى او النوتيلا',
              style: TextStyle(
                fontSize: 20,
              ),
              textDirection:TextDirection.rtl,
            )
          ],
        ),
      ),
    );
  }
}
