import 'package:flutter/material.dart';
class P1 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
   return Container(
     child: SingleChildScrollView(
       child: Column(
         
         children: [
           Image.asset('assets/image/p1.jpj.jpg'),
           Text('قومى بتقطيع البصل إلى قطع صغيرة جداً، ثم ضعيه فى المقلاة بعد وضع ملعقة كبيرة من السمن، ثم ضعى اللحم المفروم إلى المقلاة بعد تحول لون البصل إلى الأصفر، ومن الممكن أن تضيفى هنا قليل من الملح حسب الحاجة، واتركى الخليط حتى ينضج.أما الخطوة التالية، قومى بوضع كمية من الماء فى وعاء واتركيه حتى يصل إلى الغليان، قومى بوضع المكرونة، ويفضل تقليبها من فترة لأخرى حتى تنضج المكرونة تماماً، قومى بعد ذلك بتصفيتها وغسلها بالماء البارد.احضرى "صينية" وضعى بها ملعقة السمن فيها إلى أن يذوب تماماً، وبعد ذلك ضيفى الدقيق وابدأى فى التقليب حتى تمتزج المكونات مع بعضها بشكل جيد، وهنا يضاف اللبن بشكل تدريجى حتى تحصلى على القوام المناسبتخلط المكرونة بعد ذلك مع نصف كمية البشاميل فى إناء واسع، وهنا تقسم المكرونة إلى قسمين، يوضع الجزء الأول فى الصينية المخصصة للتسوية، ثم وضع اللحم المفروم وفرده على المكرونة بطريقة متساوية، ومن بعده كمية المكرونة المتبقيةالخطوة الأخيرة تعد هى الأهم، حيث توضع الكمية المتبقية من البشاميل ويفضل هنا خفق بيضة على البشاميل قبل وضعه على وجه "الصينية"، حتى تحصلى على مذاق رائع، وتترك فى فرن درجة حرارته متوسطة لمدة ساعة إلا ربع تقريباً',
             style: TextStyle(
               fontSize: 20,
             ),
             textDirection:TextDirection.rtl,

           )
         ],
       ),
     ),
   );
  }
}

class P2 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
        child: SingleChildScrollView(
        child: Column(
        children: [
          Image.asset('assets/image/كفتة.jpg'),
          Text('يُوضع كل من؛ البصل، ولحم الخروف، والبقدونس، وزيت الزيتون في محضّرة الطعام، وتُهرس جيداً حتى تُصبح ناعمة جداً. يُضاف كلّ من؛ الملح، والفلفل الأبيض، والفلفل الأسود، والكمون وتخلط المكونات مرة أخرى معاً، حيث يمكن إضافة بعض التوابل المرغوب بإضافتها أيضاً. تبلّل اليدين بالماء، أو يمكن استخدام القفاز، من أجل تشكيل الكفتة على شكل كرات متوسطة الحجم، أو يمكن استخدام أعواد خشبية، وتشكيل الكفتة عليها، وحينئذٍ تصبح كفتة لحم الضاني جاهزة للطهي، إذ يمكن عمل كفتة اللحم على الفحم الذي يعطيها مذاقًا شهيًا.',
            style: TextStyle(
              fontSize: 20,
            ),
            textDirection:TextDirection.rtl,

          )
        ],
      ),
        )
    );
  }
}
class P3 extends StatelessWidget
{
  @override
  Widget build(BuildContext context) {
    return Container(
        child: SingleChildScrollView(
        child: Column(
        children: [
          Image.asset('assets/image/ملوخية.jpg'),
          Text('نظفي الأرنب جيدًا وافركيه بالملح والدقيق واتركيه مدة ساعة ثم اغسليه جيدًا قطعيه إلى أربع ثم اسلقيه مع بصلة وفص ثوم وملح وفلفل وحبة حبهان صفيه وحمريه في الفرن افرمي أوراق الملوخية بعد قطفها ناعمًا اغلي مرق الأرنب جيدًا ثم ضعي الملوخية فيها وقلبي للأعلى. اطفئي النار عندما تقارب على الغليان ولا تجعليها تغلي فتفور. أثناء ذلك ضعي الزبد، وحمري الثوم مع الكزبرة والكمون ثم ضعيها مع الملوخية فور إطفاء النار أضيفي الملح والفلفل حسب الرغبة قدمي الملوخية مع الأرز الأبيض أو مع الأرز بالشعيرية والأرنب المحمر  يمكنك إعدادها بالطريقة نفسها مع الدجاج أو اللحم  كمية المرق حسبما ترغبين إن كنت تحبينها سميكة أو خفيفة فالقوام المتوسط يكون كوبين من المرق مع نصف كيلو ملوخية  الطريقة نفسها تصلح للملوخية المجمدة والجافة',
            style: TextStyle(
                fontSize: 20,
            ),
            textDirection:TextDirection.rtl,
          )
        ],
      ),

        )
    );
  }
}
